chapter1/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>readme</title>
<!-- 2017-09-14 周四 04:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/simple-frame.css" />
</head>
<body>
<div id="content">
<h1 class="title">readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. chapter-1</a>
<ul>
<li><a href="#sec-1-1">1.1. recursive process -&gt; iterative process</a></li>
<li><a href="#sec-1-2">1.2. orders of growth</a></li>
<li><a href="#sec-1-3">1.3. tree recurse</a></li>
<li><a href="#sec-1-4">1.4. great common divisors</a></li>
<li><a href="#sec-1-5">1.5. testing for primality</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. searching for divisor</a></li>
<li><a href="#sec-1-5-2">1.5.2. the fermat test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> chapter-1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> recursive process -&gt; iterative process</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In general,the technique of defining an ivariant quantity that remains unchanged from state to state is a powerful way to think about design of iterative algorithms.
</p>

<p>
`
</p>
<pre class="example">
(define (expt b n state-var)
	(if (= n 0)
	1
	(expt b (- n 1) (* b state-var))))
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> orders of growth</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We say that R(n) has orders of growth &theta;(f(n)) ,written as R(n) = &theta;(f(n)),
if there are positive constants k1 and k2 independent of n such that R(n)
is sandwiched  between k1*f(n) and k2*f(n)
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> tree recurse</h3>
<div class="outline-text-3" id="text-1-3">
<p>
fib series: 0 1 1 2 3 5 8 13&#x2026;
</p>
<pre class="example">
transfomation T:
                     |
                  /      \               
                left   right   
                |                       
               /  \                   
             left right      
              |                      
            / \                     
      left right          

left + right -&gt; left
left         -&gt; right
</pre>

<p>
Observe that applying this transfomation over and over again n times ,starting with 1 and 0 ,produced  the pair Fib(n) Fib(n)
</p>

<p>
The fibonacci numbers are produced by applying T n times.
</p>

<pre class="example">
(define (fib n)
  (define (iter-fib left right n)
    (cond ((= n 0) right)
	   (else (iter-fib (+ left right) left (- n 1)))))
  (iter-fib 1 0 n))
</pre>

<p>
accelerate the transfomation
</p>

<p>
consider T to be the special case of p=0 and q=1 in a family of transfomations T(p,q)
</p>

<p>
,where T(p,q) transfors the (left, right) according to
</p>


<pre class="example">
(p + q)*left + q*right -&gt; left

q*left + p*right -&gt;right
</pre>

<p>
then for T<sup>2</sup> we have transfomation:
</p>

<pre class="example">
(p^2 + 2pq +2q^2)*left + (2pq +q^2)*right -&gt; left

(2pq + q^2)*left + (p^2 + q^2)*right -&gt; right
</pre>
<p>
related code using T<sup>2</sup>
</p>

<pre class="example">
(define (fast-fib n )
  (define (oven? x) (= (remainder x 2) 0))
  
  (define (iter-fib left right p q n)
    (cond ((= n 0) right)
	  ((oven? n)
	   (iter-fib (+ (* (+ (* p p) (* 2 p q) (* 2 q q)) left)  (*(+ (* 2 p q) (* q q)) right))
		     (+ (*(+ (* 2 p q) (* q q)) left) (* (+ (* p p) (* q q)) right))
		     p
		     q
		     (/ n 2)))
	   (else (iter-fib (+ left right) left p q  (- n 1)))))
  (iter-fib 1 0 0 1 n))
</pre>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> great common divisors</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Euclid's Algorithms
</p>

<pre class="example">
(define (gcd dividend divisor)
	(if (= divisor 0)
	dividend
	(gcd divisor (remainder dividend divisor))))
</pre>
<p>
the order of growth is theta(log n) (proved by lame's Themorem)
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> testing for primality</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> searching for divisor</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
one fact: <b>if n is not prime, it must have a factor(not equal to 1)less than or equal to sqrt of n.</b> 
Based on this fact, the algorithms need only test divisor between 1 and sqrt of n.
</p>

<pre class="example">
(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((&gt; (square test-divisor) n ) n)
	((divided? n  test-divisor) test-divisor)
	(else (find-divisor n (+ test-divisor 1)))))

(define (prime? n)
	(= (smallest-divisor n) n))
</pre>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> the fermat test</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>fermat's little theorem:
if n is a prime number, and a is any positive integer less than n,then     
</li>
</ul>
<p>
<b>(remainder a<sup>n</sup> n) = (remainder a n) = a</b>
</p>

<ul class="org-ul">
<li>caculate mod(a<sup>n</sup> , m)
</li>
</ul>
<pre class="example">
(define (expmod base expt m)
  (if (= expt 0)
      1
      (remainder (* base (expmod base (- expt 1) m)) m)))
</pre>
<ul class="org-ul">
<li>test
</li>
</ul>
<pre class="example">
;;; a time of random test
;;;  random return a integer less that its input.
;;; Hence ,to  get a number between 1 and (n-1) inclusive,
;;; we call *random* with an input of (n-1) and add 1 to the result.
(define (fermat-test n)
  (define (try-it a)
    (= (expmod a n n) a))
  (try-it (+ 1 (random (- n 1)))))
    


(define (fast-prime-test num times)
  (cond ((= times 0) true)
	((fermat-test num)  (fast-prime-test  num (- times 1))) ;;;if it pass , times of test substact 1
	(else false)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-09-14 周四 04:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
